import { TypeData, TypeFlashCard } from '../interface'

const id = 'btr-80'

const name = '技規 #80 非防火構造物的防火區劃'

const head: TypeData[][] = [
]

const data: TypeData[][] = [
  ['依面積([1hr防火 1hr阻熱])', '不燃材料', '總FA每[1000]m²', '<', '<'],
  ['^', '^', '區劃牆', '突出[50]cm', '且[貫穿]'],
  ['^', '^', '^', '長度[90]cm', '且[一小時防火]'],
  ['^', '不燃材料', '總FA每[500]m²', '<', '<'],
  ['^', '^', '區劃牆', '突出[50]cm', '[貫穿且獨立構造]'],
  ['^', '^', '^',  'X[無筋混凝土]', '<'],
  ['^', '^', '^', 'X[磚石造]', '<'],
  ['^', '^', '^', '窗：[2.5m x2.5m (1hr防火 1hr阻熱)]', '<'],
  ['^', '^', '區劃牆交接處', '無開口：[3.6m (1hr防火)]', '<'],
  ['^', '^', '^', '有開口：[1hr防火門窗]', '<'],
  ['例外', '用途', '體育館', '<', '<'],
  ['^', '^', '工廠生產線', '<', '<'],
  ['^', '^', '工廠生產線', '<', '<'],

]

export const Flashcard: TypeFlashCard = {
  id,
  name,
  head,
  data,
}
